#include <iostream>
#include "ui.h"

int main() {
    start(); // Запуск интерфейса пользователя
    return 0;
}
/*
g++ main.cpp array_sequence.h binary_insertion_sorter.h insertion_sorter.h comparator.h data_generator.cpp data_structure.h isorter.h sequence.cpp shaker_sorter.h ui.cpp smrt_ptr.h -o sorting_program

.\sorting_program.exe
*/ 

/*
1. Убрать дата утилс и переместить в дата генератор
2. Переделать работу с файлами: подгружать только нужный мне параметр
    и номер строки, сортировать, а потом дособирать
3. Пошаманить с isorter и сделать то, че он говорил
4. 

1. Метод пузырька  
2. Сортировка с помощью простого выбора  
3. Сортировка подсчетом 
4. Квадратичная сортировка (усов. сортировка выбором)
5. Сортировка с помощью выбора из дерева  
6. Сортировка слиянием 
7. Пирамидальная сортировка  
8. Быстрая сортировка 
9. Сортировка Шелла  
10. Сортировка Шелла (с выбором смещения) 
11. Схема Бэтчера
*/
